{"messages":[{"message":"Explorers confirm Telegram's TON address\n\nWe are glad to know that our recent post attracted the tremendous interest of the entire TON community. According to the statistics, more than 100 people and channels reposted this gem. More exciting is that ecosystem-essential products have decided not to stand aside and started confirming our thoughts.\n\nToday, tonscan.org has updated its address book by adding until recently an unknown TON address as \"Telegram Team.\" Meanwhile, tonapi.io, another well-prominent explorer on The Open Network, has started displaying a new type of action called \"DNS.Tg\" as well as the new interface \"telegram_auction.\"\n\nIt has been immensely gratifying to see how a major number of the TON channels and subscribers were discussing our recent post. We are pleased to announce that we have prepared a couple of big news, regarding The Daily TON, and will tell you about them in the very near future. Stay tuned!","id":193,"poster":"./images/posts/193.jpeg"},{"message":"The way to follow TON’s statistic\n\nEvery seven days, TON Community publishes weekly digests with detailed statistics on how many accounts were created on The Open Network for the past week. Usually, ton.org provides real-time information about the number of transactions, accounts, and validators in the ecosystem, but there is no clear opportunity to track these indicators in dynamics.\n\nFortunately, the site tontech.io gives detailed information on various categories. Users can select a week or month view to see how the numbers grew over a specific time. For example, for the last year the number of registered TON-addresses increased almost 16 times.\n\nWe still do not know why there are no mentions of tontech.io on the official or semi-official (like ton.app) communities, though the page appearance resembles the canonical one.","id":192,"poster":"./images/posts/192.jpeg"},{"message":"Is Telegram integration around the corner?\n\nWe do not clickbait you at all: the title tells what we believe is about to happen — the integration of TON NFT into Telegram. Before we go into detail about our investigations, you should be aware that all of the information was acquired from public sources. It was an exciting experience to dive deeper into the hidden recesses of Getgems.\n\nOver three weeks ago, the TON Foundation transferred 10,000 Toncoin to an unknown address. What happened next: this new address transferred 1 TON to the royalty address of the NFT collection \"Telegram usernames.\" When we open the collection's Getgems page, we can see that the entire collection is made up of invalid Non-Fungible Tokens under the names username.t.me, as recently suggested by Pavel Durov.\n\nIs it enough to guess that a significant event is anticipated to occur soon? If not, have a look at this: \"testasmico.t.me\" is the name of the very first NFT to ever appear in this collection. @asmico is one of the Telegram developers who creates different channels or chats for test purposes from time to time — e.g., translation_testasmicolanguage, where the chat owner is the official Telegram account. More likely, he was testing how the NFT usernames work.\n\nIt might be a coincidence and it is still a long way to go, but what if not?","id":191,"poster":"./images/posts/191.jpeg"},{"message":"Further integration of TON into Telegram\n\nIt has been almost two months since Pavel Durov has announced the upcoming integration of The Open Network’s native token into the messenger app. Back then, the Telegram CEO said he was impressed by the success of the open TON auction. The opportunity to grab a .ton domain attracted thousands of users who burned more than 3 million Toncoin in total.\n\nAlthough many Telegram fans have not welcomed this decision, TON users are looking forward to the upcoming bit of Web 3.0 on Telegram. It is still unknown when the messenger team plan to introduce the highly-awaited update, but we are sure we have to wait just a little more.\n\nIt has become commonplace when a social network or a popular app integrates blockchain technologies, especially NFTs. Telegram should not lag behind the emerging trade, and the upcoming TON integration can become a key success factor for it.\n\nWhat if the coming week will bring us a promised integration?","id":190,"poster":"./images/posts/190.jpeg"},{"message":"The official website ton.org is now available in Spanish\n\nThe last months were rich with new updates both in the official and community-made products. At the same time, the number of people (and also the number of TON wallets) involved in the TON ecosystem was gradually increasing. Now, more than a million crypto enthusiasts are engaged in building the TON Blockchain.\n\nOf course, we should not write off people who are subscribed on multiple channels, but the fact is TON continues growing. We especially want to mention that The Open Network is expanding on different regions around the world (what also Fanzee does), and this is not surprising that starting today, the official TON website — ton.org — has become available in Spanish, the world’s second-most spoken native language.\n\nIt is nice to see that The Open Network does not limit itself to only some regions — e.g., CIS or Middle East — but tries to find a new and new audience worldwide. Hope to see newcomers in the TON ecosystem!","id":189,"poster":"./images/posts/189.jpeg"},{"message":"TON Glossary\n\nA few days ago, the Russian Telegram channel Deep Ton made a post with the so-called TON Glossary, a list of different terms used in the cryptocurrency sphere as well as in the TON ecosystem.\n\nWe are glad to introduce that this information is now available in English. It can be helpful for beginners who are just getting to know The Open Network. In fact, it is a great way how experienced TON users can share the basis of the blockchain with newcomers.\n\nClick here to check it out.\n\nWe thank Deep Ton for such scrupulous work and remind our subscribers about our support bot. Feel free to ask us questions or give feedback regarding the glossary and the terms represented there.","id":188,"poster":"./images/posts/188.jpeg"},{"message":"Soulbound standard is finally adopted\n\nWe have already written many times about the imminent release of the Soulbound standard, and finally, Getgems has announced that TON Foundation adopted the standard on The Open Network.\n\nA few months ago, we described the mechanism of Soulbound NFTs — you can learn more by this link. Simply put, SBT is an NFT owned by a single person that cannot be transferred or sold to someone else.\n\nAccording to the official announcement, the purpose of the SBT token is to display achievements of a specific wallet, sell subscriptions, or function as online verification (it is what Binance has recently introduced). \n\nMore and more ways to use NFTs appear on The Open Network. We believe it will promote the ecosystem even further.","id":187,"poster":"./images/posts/187.jpeg"},{"message":"Huobi has announced that they will not impose restrictions for Russian users: https://t.me/RussianHuobi/62\n\nWe're happy to hear that our users don't have to worry about their tokens that were staked during the last promotion.","id":186},{"message":"New products in the TON ecosystem\n\nThe Open Network is a young but promising blockchain where each day brings us something new and special. We are glad to tell you that today is no exception, and some new projects have recently appeared in the ecosystem.\n\nLet us start with Uniton, a non-custodial wallet developed by Tegro Team. Unlike many other third-party wallets, Uniton is a cross-platform solution available to users of almost all major platforms. You can learn more about the wallet by reaching out to its official Telegram channel.\n\nAnother newcomer in the TON ecosystem is a developing marketplace, Playmuse. According to the website, the developers set to build a decentralized platform where users can listen to music or podcasts and also influence the plots of shows, TV series, video blogs, and streams. It is worth mentioning that there are similar projects on other blockchains, for example, Vuele.\n\nThe Open Network continues to see new developers, with the growth of the audience and the number of products expanding the ecosystem.","id":184,"poster":"./images/posts/184.jpeg"},{"message":"AMA with Ajay Jojo, CEO at Fanzee\n\nThe next few days promise to be prosperous in the TON ecosystem. On October 8, Tonstarter draws allocations, and the token sale will begin a couple of days later. We have mentioned the importance of the upcoming IDO on The Open Network several times. Such major events like IDO can be a perfect indicator of ecosystem readiness.\n\nAjay Jojo, CEO at Fanzee, held an AMA session in the private investors' channel before the token sale has not started yet. The entrepreneur shed some light on different topics regarding the prospects of Fanzee. In the first place, Ajay talked about why they have decided to build on The Open Network. He noted that TON is capable of bringing the benefits of blockchain technology to everyday people, especially those who are keen on sports. \n\nCurrently, Fanzee plans to establish agreements with 50 clients across sports and esports by the end of the year. (It is worth mentioning that the Fanzee team has recently gone to Brazil for this purpose) Other than that, there was no mention of the upcoming FIFA World Cup in November. The event can benefit Fanzee greatly, which is why the project members work deeply with many federations. In fact, Fanzee does not want to become a new title sponsor of some country or a club — their purpose is to build a long-term partnership to drive a fan base.","id":183,"poster":"./images/posts/183.jpeg"},{"message":"New integrations of Toncoin\n\nWe cannot help but share with you more and more projects integrating The Open Network and its native token — Toncoin. The hosting provider aeza.net started accepting payments in Toncoin with no fees. It is worth mentioning that TON is the only cryptocurrency presented on the website that has no commission to top up an in-site account.\n\nRecently, TON Community mentioned a well-know betting company BilBet, which is considered to be popular in India and Uzbekistan. The bookmaker among the first integrated Toncoin. Perhaps you can argue that popularizing TON through gambling platforms or narrowly targeted websites is not good. In fact, the development of decentralized cryptocurrencies, e.g., Bitcoin, began with the help of darknet users and bookmaker companies. Over time, the situation has changed, and more people have understood the benefits of decentralized networks.\n\nNowadays, The Open Network experiences everything that top cryptocurrencies went through many years ago: integrations to well-known products, the increase in the number of users, development of its ecosystem. \n\nHope to see TON not stop achieving new and new integrations!","id":182,"poster":"./images/posts/182.jpeg"},{"message":"The Daily TON x StickerFace \n\nWe put a lot of care and concern into choosing our collaboration partners, and today we are excited to announce that we are launching a giveaway with StickerFace, a prominent project on The Open Network.\n\nFor those who do not know, we remind you that StickerFace is an NFT avatar maker with a collection of 30,000 NFT clothes and accessories for the avatars. Users can easily dress up their avatars in a myriad of different wearables.\n\nDuring the contest, our subscribers can win one of 50 NFT loot boxes worth 60 TON (it is more than $100!). Every loot box contains a unique wearable that you can use to dress up your avatar and make it even more special. \n\n👉 Follow this link or the button below to participate in the giveaway! Try your chances at winning one of these exciting NFTs!","id":180,"poster":"./images/posts/180.jpeg"},{"message":"TON receives support from the Russian federal channel\n\nWe have discussed several times how TON can achieve mass adoption by implementing different technologies or attracting investments (e.g., the Soulbound standard or Fanzee’s journey to IDO). These events definitely raise awareness about The Open Network around the world.\n\nHowever, when we speak about ordinary people, they are usually not familiar with cryptocurrency and why it matters. That is why it is always lovely to see when cryptocurrencies, especially TON, break into the layer of daily routines like TV programs.\n\nThis morning, one of the most prominent Russian federal channels, Russia-24, made a report dedicated to the recent @wallet’s release as well as touched upon the topic of The Open Network’s history. \n\nWe consider this a big event because Toncoin is widespread among the Russian-speaking audience. We hope this mention will encourage the legalization of Toncoin and other cryptocurrencies in Russia.","id":179,"poster":"./images/posts/179.jpeg"},{"message":"Introducing the first search engine on TON\n\nIt has been several days, and the first projects developed on the recently-launched TON Sites have started appearing. The first search engine available at searching.ton popped up today and drew the attention of TON enthusiasts. The site, similar in appearance to well-known Google or DuckDuckGo, parsers all the web3 sites on The Open Network. Currently, it is toncenter.ton, just-for-test.ton, and foundation.ton. The developers kindly ask the first testers to send feedback to this user. You can follow upcoming updates and find more details on their channel.\n\nWe remind you that it is necessary to configure a proxy server to in1.ton.org:8080 before you visit .ton sites. TON Foundation posted detailed information on how to set up a proxy server on GitHub. Please, visit this page if you experience some problems.\n\nWould you like to see The Daily TON on web3? Please share your opinions via our bot! And also, do not hesitate to ask us any questions regarding configuring proxy or anything else — we are always open to help you!","id":178,"poster":"./images/posts/178.jpeg"},{"message":"An alternative way to purchase Toncoin\n\nDespite the recent TON Sites release, with its mission to provide every people in the world the right to access information, all human-beings have to continue living in the context of politics, regulations, unjustified prohibitions, and other nasty things that ordinary citizens should not be involved in. \n\nFor example, many people cannot visit different crypto exchanges due to American regulations. However, it is nice to know that we are all on the Internet, so there are always hidden paths to get your way. In case of cryptocurrencies, Peer-to-Peer (P2P) services, like @CryptoBot, can become your cup of tea if you face prohibitions.\n\nIt is worth mentioning that there will be no risks if you try to exchange your dollars for Toncoin and vice versa. The service acts as an intermediary and will keep your funds until you confirm the transaction.\n\nFor over three months, we constantly delight our readers with fresh news on The Open Network. We want to thank all of you who get through our posts with this small check for 50 activations.","id":177,"poster":"./images/posts/177.jpeg"},{"message":"Qubedao launched the oracle on TON\n\nQubedao, one of the first projects on TON aimed to launch a stablecoin, recently unveiled the first decentralized oracle on The Open Network. A blockchain oracle is designed to provide smart contracts with data from outside or third-party sources. Qubedao's solution is to give the current price of Toncoin in a decentralized and safe way.\n\nUsually, the ecosystem's protocols receive the token price through the API of CoinMarketCap, FTX, or Coinbase. In case of DeFi projects, it may lead to severe problems if the service experiences a DDoS attack or some bug appears. The oracle, created by Qubedao, takes information from multiple sources and checks it against others. If it matches, the oracle passes the info to the DeFi service, providing users with the exact token price.\n\nWe wish the team to implement its Oracle in the mechanism of the upcoming DEX successfully. You can learn more about the oracle by this link.","id":176,"poster":"./images/posts/176.jpeg"},{"message":"Stack Overflow opposes questions about TON \n\nLast month we wrote about intends of creating a TON knowledge library on Stack Overflow pushed by TON Society. TON Society then revealed a bonus program for active users contributing on a question-and-answer site. Developers could get answers as well as start discussions on any question on a user-friendly site, if not for one thing.\n\nAccording to Tal Kol, a well-known TON Society contributor, TON Blockchain and all questions regarding it were not welcome by StackOverflow administrators. The site representatives still did not give clear answers why such type of content they do not want to appear. However, it seems the solution was found by many The Open Network contributors engaged in active discussions.\n\nRecently, TON Foundation has created a new subdomain — answers.ton.org. The site is built on Scoold, an open-source project that copies Stack Overflow. It will be moderated by active contributors in the TON ecosystem representatives instead of taciturn StackOverflow’s admins.  \n\nThough the decision is still pilot, we hope it will get feedback from the TON community.","id":175,"poster":"./images/posts/175.jpeg"},{"message":"Here it is: the basis for web3\n\nWe do not intend to repeat the same news that you have heard today — TON Proxy & Sites releases. Let us better consider what perspective these will open up for the TON community and the whole world in general. \n\nFirst, with slow steps but TON Foundation continues to develop new and new technologies and constantly implement them into The Open Network. Community confidence has certainly grown in recent months, thanks to the active work of developers. This year has already brought us the first NFT-standards, marketplaces, a sea of the TON wallets, explorers, .ton domains, contests, and now TON Sites. TF showed in practice their desire to develop blockchain and follow the stated road map. \n\nMeanwhile, TON is starting to pop up on different world-renowned platforms, such as CoinMarketCap and NFT Calendar, as well as on crypto exchanges — Huobi, MEXC, and others. We believe the TON community, all people gathered together in the ecosystem, are at the very beginning of something that will turn the world over.\n\nSecond, the recently-announced TON Proxy and TON Sites undoubtedly can change what we mean by the word Internet. Starting today, users can touch this buzzword called web3. Just set up an entry proxy and go to foundation.ton — here it is, the upcoming opportunity to be in a decentralized anonymous part of the Internet built on The Open Network.\n\nWe are pleased to be one of the first English media about TON. Stay with us, more to follow!","id":174,"poster":"./images/posts/174.jpeg"},{"message":"One day left until TON Proxy & Sites release \n\nBefore the TON Foundation kicks off the new technologies, we know that the TON community is preparing. Meanwhile, the documentation on the work of TON Proxy continues to be updated. Today, the instructions on how a user can link his TON DNS domain to a web3 website appeared on the official GitHub page. \n\nMore interestingly, according to the documentation, users can create a smart contract on The Open Network, which will allow an auction for subdomains. For example, the owner of the wallet.ton domain can hold an auction for selling second-level domains such as toncoin.wallet.ton, shop.wallet.ton, and others.\n\nWe are looking forward to the upcoming release, so we suggest the community familiarize themselves with the documentation in advance. We advise you to look over these documents if you are interested in building a decentralized internet on The Open Network.","id":173,"poster":"./images/posts/173.jpeg"},{"message":"TON Proxy is right around the corner\n\nLast week we posted an article regarding the upcoming TON Proxy & TON Sites releases. Today, we’re glad to announce that the core developer of The Open Network, tolya-yanot, updated the documentation on how to get started with the brand-new technologies.\n\nAccording to a GitHub page, to access TON Sites, users need to download rldp-http-proxy from TON Auto Builds, which will be available for Windows, macOS, and Ubuntu later, as well as set it up with TON Global Config. Moreover, if you are interested in running your personal TON website, you will have extra to download a generate-random-id tool. We remind you that TON Proxy is a network proxy/anonymizer layer for TON nodes, similar to I2P. This key component, combined with TON DNS and TON P2P Network, will give decentralized apps immunity to censorship.\n\nVery soon, users will be able to not only access websites via TON Proxy but also create their own. More details on the process of launching your first web3 site are presented on the GitHub page. We expect the release to unveil on Friday, September 30.\n\nIf you have any questions, please, feel free to reach us via our bot.","id":172,"poster":"./images/posts/172.jpeg"},{"message":"Rift, a framework to build on TON\n\nThis summer, TON Foundation has provided grants to several teams of developers to build ecosystem-important products. One of them was dBuilder, a Python framework for smart contract building on TON. The developer aimed to create a tool to help programmers make the development, testing, and deployment procedures much easier.\n\nNot so long ago, dBuilder was rebranded as Rift, and, more importantly, the main contributor finished the work on the first milestone. The original framework developer recently launched a website with documentation on how to get started with Rift, lowering the entry threshold significantly for people familiar with Python. Now, it is available on GitHub.\n\nWe are also pleased to announce that in the near future, we plan to conduct a text interview featuring the developer of Rift. We ask our subscribers to send their questions regarding the Python framework via our bot – the best questions will be rewarded.","id":171,"poster":"./images/posts/171.jpeg"},{"message":"Apple will allow in-app NFT sales, but will apply 30% fees\n\nAccording to a recent The Information report, Apple, one of the leading tech companies in the world, will allow developers to sell Non-Fungible tokens (NFT) through its platform. \n\nThe community calls the company’s decision “absurd” since the 30% commission appears exorbitant to users who are used to paying a 5% fee on marketplaces like OpenSea, Magic Eden or Getgems. Moreover, Apple’s solution seems even more ridiculous as the tech company has nothing to do with these transactions. Usually, users complete transactions themselves through their devices. It is worth mentioning that in some regions, Apple’s commissions may exceed 35%. \n\nStickerface, an NFT avatar creator built on The Open Network, also has a convenient app in the App Store that allows users to mint an avatar. Despite the generated sticker pack, users can customize their character with the help of many accessories stored in loot boxes. Perhaps, one day the Stickerface app will allow its users to purchase accessories via Apple Pay.","id":170,"poster":"./images/posts/170.jpeg"},{"message":"TonSwap, a new DEX on TON\n\nLast month we mentioned a hot new update on Tonana, a DeFi Hub on The Open Network, that added support for the first wrapped tokens on TON. Much has changed since then as Tonana made several highly-important things: first, they received another grant from TON Foundation, and another one is their establishing partnership with TonSwap.\n\nSince BITON left The Open Network some months ago, it became necessary again to have a quality decentralized exchange. At this moment, TonSwap came to play to fill this gap. Currently, several programmers from Orbs are developing the DEX. Orbs is an L3 blockchain infrastructure provider that recently expanded to The Open Network. Orbs Network's founder, Tal Kol, is one of the most popular TON Society contributors — we mentioned his articles on our channel several times. \n\nRecent agreements with Tonana allowed swapping wrapped NEAR and Solana tokens, despite community-made jettons – BOLT and HEDGE. So, if you were looking for a tool to swap your jettons, we guess it is a match. However, it is worth mentioning that the exchange is still working in Beta so some bugs can appear. \n\nIf you have something to add, please, do not hesitate to reach us via our bot.","id":169,"poster":"./images/posts/169.jpeg"},{"message":"Contests on The Open Network\n\nOn our channel, different contests, hackathons, and competitions held by TON Foundation occupy a special place – we believe it is a beautiful way to try your hand at developing the ecosystem. Since TON is a strong but nascent blockchain, there are many methods to make your way and be known within The Open Network. That is what contests run for.\n\nCurrently, there are three active contests: TON Test Challenge, TON Design Challenge, and Whales Design Contest. Let’s start with the first one. If you have not entered the contest yet, please, hurry up! Only one day remains until the challenge ends. Actually, it is an excellent social elevator to become part of the TON Foundation. As ton.org says, “The top participants will get a chance to join the core TON Foundation team as manual QA Engineers.”\n\nTF does not very often hold design competitions, that is why you should not hesitate to participate in them if you are keen on visual graphics or UI. Last but not least factor is money. Usually, participants have chances to grab decent awards, so we advise you to just cut to the chase and try to become a winner.","id":168,"poster":"./images/posts/168.jpeg"},{"message":"TON and mass adoption\n\nWhat associations do you have when you hear TON, Toncoin, or The Open Network? Probably, different marketplaces, NFTs, crypto wallets, or staking. And you are absolutely right: it is what our ecosystem consists of. However, when we speak about TON’s mass adoption and its use cases, usually driven by low fees and fast transactions, we should understand that not all people are crypto-geeks crazy about new technologies. Like a grandmother who did not hear anything about crypto assets, many people appreciate different things that can have nothing to do with your interests.\n\nFanzee, a fan engagement platform that we mentioned several times, strives to connect two different worlds: the blockchain and sports. Unlike many other projects in the ecosystem, it will allow bringing ordinary people to the TON ecosystem. Now, the Fanzee team has a journey to Brazil to establish agreements with a number of different sports clubs that will be later presented on their platform. Their fans will interact with the TON blockchain, though they do not completely understand it. \n\nThat is how one project can attract a million fan base into the blockchain. What if such products, like Fanzee, will pop up further? Definitely, it will be a mass adoption that many enthusiasts dream about. Hope to see Fanzee will meet the expectations.","id":167,"poster":"./images/posts/167.jpeg"},{"message":"Toncoin passed verification on CoinMarketCap\n\nCoinMarketCap, the world’s most popular price-tracking website for crypto assets, finally verified TON, bringing it up to the 34th place. Toncoin stayed in the 202nd place for a long time since the verification was not fully completed.\n\nThe crypto resource platform is famous among many crypto enthusiasts. A recently-started TON Community blog on CoinMarketCap will help many investors to get familiar with TON. \n\nWe’d like TON enthusiasts to subscribe to the TON Community on CoinMarketCap and be active enough to asset beginners to get acquainted with The Open Network.","id":166,"poster":"./images/posts/166.jpeg"},{"message":"CertiK AMA session with Justin Hyun\n\nToday, CertiK, a leading security-focused ranking platform that conducted smart contract audits for many prominent projects, hosted an AMA session featuring a Head of Incubation at TON Foundation, Justin Hyun. During the conference, Hyun mentioned The Open Network's advantages as well as expressed his opinion on blockchain's future. According to the Head of Incubation, TON, thanks to its deep integration with Telegram, has an opportunity to reach 700 million Telegram audience due to various solid ecosystem projects like @wallet or getgems.io.\n\nA recently-introduced web app's interface allows users to easily use their favorite cryptocurrency in a robust and user-friendly appearance without the need to leave the messenger. As Justin also pointed out, the process of both buying and sending Toncoin is made very simple so that even beginners can cope with purchasing tokens.\n\nTON develops as a blockchain with the prospect of integration into Telegram. Another ecosystem's fundamental project, Getgems, has partly integrated into messenger with the use of different bots. Finally, Justin Hyun shed some light on agreements with the messenger app: he said that in the future, when Telegram and TON would have different partnerships, users can be allowed to showcase their Non-Fungible tokens. Since every TON NFT collection has its Telegram channel, it will help the ecosystem to grow further, attracting a new and new audience.","id":165,"poster":"./images/posts/165.jpeg"},{"message":"7 reasons to invest in Bitcoin by Robert Kiyosaki\n\nRobert Kiyosaki, the author of the American bestseller Rich Dad Poor Dad, has recently posted a tweet with various statements about why people should invest in Bitcoin now. The list opens \"The US borrows too much money\": Actually, the writer is sure that the $31 trillion American debt threatens the dollar currency, and it’s more convenient to hold money as crypto assets. The other reasons are low-interest rates, which are kept in the US for a long time. They force the government to borrow more dollars to buy more US Bonds.\n\nAccording to Robert Kiyosaki, these issues lead to another reason for buying Bitcoin: inflation. In fact, it has been on the rise since 2021, peaking in June at 9.1%. Other causes include forcing interest rates up and debts becoming too expensive. The writer also believes that the American currency is dying, so people should invest in gold, silver, or Bitcoin. Interestingly, Robert Kiyosaki suggested to his followers to make investments in Ethereum previously.\n\nDo you think there are any reasons to invest in TON? Please, share with us your opinions via our bot. We’re ready to create a more detailed post regarding the issue.\n\nRemember: The above opinions do not constitute financial advice.","id":164,"poster":"./images/posts/164.jpeg"},{"message":"The Open Network will participate in Hacktoberfect\n\nEvery year DigitalOcean – an American cloud infrastructure provider – hold Hacktoberfest, a monthly-long event that encourages people to contribute to open source project within October. Recently, TON Society was pleased to announce that The Open Network will participate in Hacktoberfest 2022. For users, it is an excellent chance to help your favorite projects and even win prizes. \n\nWhat is more exciting is that you do not have to be a developer to enjoy taking part in Hacktoberfest. You can contribute to the projects by fixing bugs or correcting typos, improving translations, or even fixing links – there are no bad pull requests.\n\nSuch events as TON Test Challenge or Hacktoberfest are an opportunity to drive the whole ecosystem growth and to support projects there. In the case of TON Test Challenge, it has already attracted dozens of contributors to find different bugs in TON’s ecosystem products. We believe such events allow TON to develop further and further.","id":163,"poster":"./images/posts/163.jpeg"},{"message":"What should Q3 2022 bring to TON?\n\nAbout three months ago, we made a post devoted to the end of Q2, describing what it meant for the TON ecosystem in detail. Today, less than two weeks before the end of this quarter, we would like to do the same: tell you more about developments that should appear very soon.\n\nBy the end of this quarter, TON Foundation must show at least two highly-anticipated technologies: TON Proxy and TON Sites. The first one can be compared with I2P (encrypted private network layer where nobody sees your location and activity) used to hide TON Network nodes' identity and IP addresses. In simple words, TON Proxy is an anonymizer to reach anonymity and security on the TON blockchain.\n\nTON Sites (or TON Network) is a fundamental technology that caters to decentralized sites. In principle, it is similar to usual websites but can only be accessed through the TON blockchain. TON Sites is an integral part of creating decentralized applications (so-called dapps) and web3 sites similar to the websites that all users are already accustomed to. In this case, all the websites can be accessed by .ton: addresse on-chain, meaning they will be functional outside the TON Blockchain, on servers available through the TON Network. \n\nThe Open Network can provide thousands of users with an absolutely new user experience. We believe that the launch of TON Sites, as well as TON Proxy, is likely to be an integral part of building Web3.","id":162,"poster":"./images/posts/162.jpeg"},{"message":"Telegram's references to TON\n\nIt has been a while since Telegram shut down Gram, a cryptocurrency based on the Telegram Open Network blockchain. For more than a year, Telegram's legacy stayed under deep water until Pavel Durov decided to transfer original repositories to the developer community in late 2021. With the new Telegram updates, including full-screen and video emojis, and emoji statuses, the number of references to Toncoin (or Gram?) continued increasing.\n\nIn 2021, Telegram kicked off a new update that added video calls and, more importantly, animated emojis. Over the last year, the messenger app constantly implemented more and more animated emojis. Once there was added 👛 (click on it to see in full-size) that featured Toncoin's symbol. Later appeared 💱 that showed the process of changing fiat currency to TON. \n\nTelegram did not limit itself to making allusions to TON on build-in emojis and, with the recent 9.0 update, rolled out the emoji pack with different icons related to the messenger app. Among dozens of emojis, there was one everyone knows — 💎.\n\nMoreover, Telegram designers usually create fancy illustrations for every major update. And, interestingly, they sometimes depict Toncoin's image — a diamond. In the last picture, you can see the diamond lying on the ground to the right of the house. Earlier, the brilliant appeared with the 8.5 update on a table in the laboratory.\n\nIt is still unknown why the Telegram team continues to feature either their abandoned project or spiritual successor (it depends on your attitude to these references). However, we believe we will get more answers as soon as June 2023 approaches, alongside the end of prohibiting the integration of cryptocurrencies based on Gram.","id":161,"poster":"./images/posts/161.jpeg"},{"message":"Tonkeeper becomes open-source\n\nTonkeeper – the most popular TON wallet on The Open Network – recently decided to switch the development mode to open source. It was a gold standard to create crypto-related products in open source from the beginning. However, Tonkeeper kept its code closed for a long time, but things have changed, and the wallet's code is now available for everyone.\n\nAs the developers say, everyone is free to review the code, ask questions, and send suggestions. Moreover, the development process will continue to be open so that every TON enthusiast can be sure project's integrity.\n\nTonkeeper goes open source code alongside TON Test challenge has started. During the contest, users need to find as many bugs as possible in the ecosystem's crucial projects, including Cryptobot, Tonhub, Tonscan, and others. To participate in TON Test challenge, contestants should check various projects on The Open Network and submit an issue on Github if any bug is found. The total prize pool is $50,000, which the best testers will divide.","id":160,"poster":"./images/posts/160.jpeg"},{"message":"Tonstarter introduces the date of the first-ever IDO\n\nWe’ve already written several posts devoted to Tonstarter, the first TON-native launchpad, and its first IDO project, Fanzee. Recently, Tonstarter announced the eagerly-awaited date of the initial DEX offering. According to the official website, the token sale stage will occur on October 10. \n\nTo participate in the upcoming IDO, you need to register for a token sale before the allocation draw is conducted. Tonstarter has also started the countdown to the final stage – be sure you have applied for IDO. It is the only way to buy FNZ tokens at the best price. For more details, visit the official launchpad’s website. \n\nDidn’t get familiar with Fanzee yet? Read this post!","id":159,"poster":"./images/posts/159.jpeg"},{"message":"TON continues filling up with materials for developers\n\nNot so long ago, we mentioned that Tonspace.co, a documentation site about TON, came to replace the old and seldom-updated previous documentation page. We are glad to announce that the surprises do not end here and introduce various articles published recently. \n\nSome new posts have appeared on TON Society’s blog, including Essential tips for new open-source maintainers by Nikita Sobolev, Introduction To Fift by Amin Rezaei, and TON Hello World (part 2) by Tal Kol. In addition to these valuable materials, a guide on how to write code on FunC, a programming language to create smart contracts on The Open Network, has appeared on Learn X in Y minutes.\n\nWe are delighted to see TON is pushing new materials and tools for programmers one after another. Hope to see this trend will not stop.","id":158,"poster":"./images/posts/158.jpeg"},{"message":"Bitcoin reached a new milestone. What about TON?\n\nFor more than 13 years, Bitcoin, a world-renowned cryptocurrency, has stayed uptime. The first Bitcoin was mined by Satoshi Nakamoto on January 3, 2009. That is how BTC's story began. The cryptocurrency made a long way and finally reached the milestone of five thousand days online on September 12, 2022. However, Bitcoin is not going to stop on it.\n\nThere were only two times when the cryptocurrency got hiccups. The first one was on August 15, 2010. Back then, an unknown hacker generated $184.467B worth of Bitcoin out of thin air that nearly destroyed the cryptocurrency. Five hours later, the blockchain was soft-forked, and nodes reached consensus.\n\nAnother hiccup appeared in 2013 due to switching the database that stored blocks and transactions from BerkeleyDB to the more efficient LevelDB. The chain forked into two, which led to double-spend attacks. In six hours, the problem was fixed, and since then, the blockchain has not experienced any hiccups.\n\nOn November 15, 2019, Telegram launched testnet2, which was renamed to mainnet in the future. With Pavel Durov's decision to leave Gram, a messenger app shut down its nodes. Fortunately, The Open Network's testnet2 was relaunched on January 2, 2021 (tell us if we’re wrong!) with new commits to the main repository. We do not surely know how much time nodes were not working, however, if you hold this information, don't hesitate to get in touch with us via our bot.","id":157,"poster":"./images/posts/157.jpeg"},{"message":"The only real TON\n\nAfter the Securities and Exchange Commission (SEC) had halted Telegram’s attempts to create a messenger-integrated cryptocurrency, Durov’s team left the project and handed it over to the enthusiasts to succeed where they failed. Gram’s open-source nature gave way to several promising projects, including Toncoin and Everscale. \n\nBack in 2020, all the developers faced uncertainty: nobody exactly knew what the community should do with an underdeveloped and open-source code. After a while, some groups of enthusiasts started to appear with different views on how previously ambitious cryptocurrency should develop.\n\nOne of them, called TON Labs, was adamant that Gram’s source code needed huge improvements, including node code rewriting. Eventually, they developed Everscale. The others, which would then become TON Foundation, were sure to follow the original whitepaper, written by Dr. Nikolai Durov. \n\nHowever, in this area of prominent projects appeared TON Token, a fake cryptocurrency operating on Ethereum Blockchain. From the beginning, it parasitized TON’s name and attracted beginners who desired to know more about Durov’s work. Instead of dealing with Gram’s spiritual continuer – Toncoin – crypto enthusiasts misunderstood the status quo. \n\nEven now, TON Token is listed on CoinMarketCap, the most comprehensive website tool to explore various cryptocurrencies. Please, remember that the only absolute TON is Toncoin. If you have ever faced people discussing TON Token, make sure they are aware of Toncoin, the Gram continuer.","id":156,"poster":"./images/posts/156.jpeg"},{"message":"Be aware of scammers\n\nAll the time, cryptocurrencies were a large field for scammers since it is as simple as that to deceive beginners with a wide range of tricks, including fishing attacks. The TON community is not an exception: among numerous people constantly building reliable projects, there are always someones who want to denigrate the whole ecosystem.\n\nIn this post, we want to remind you that founders of large projects on The Open Network will never write you first. Nobody will ask you to borrow some money as well as participate in token or NFT sales. If you face such Internet swindlers, please, report them as fast as you can – it will help others not to fall into the hands of scammers.\n\nDon’t forget: you can always ask a question via our bot!","id":155,"poster":"./images/posts/155.jpeg"},{"message":"Track upcoming Ethereum Merge\n\nThe long-awaited Ethereum Merge will occur in near five days. A leading media platform of cryptocurrencies, Watcher Guru, has recently kicked off a new page on its news website – Ethereum Real-Time Merge Tracker.\n\nAccording to current estimates presented on the site, the ETH Merge will take place on September 15 at 5:50 UTC. However, the authors still note that these estimates can change over time. The merge will occur as soon as the Terminal Total Difficulty (TTD) of 58,750,000,000T is hit. The website constantly tracks the last blocks and calculates the estimated remaining time. \n\nIt is worth mentioning that all the details contained within the website are presented in a user-friendly way, meaning it is convenient to follow the long-awaited event.","id":154,"poster":"./images/posts/154.jpeg"},{"message":"TeleTON, a messenger app with TON support\n\nIn the last post, we showed you the stunning implementation of a classic TON Wallet to Telegram. Now, let’s talk about it in more detail: A few months ago, a group of developers came together to create a messenger app based on Telegram with a built-in wallet. The project named TeleTON set a goal to combine two apps, bringing users a more convenient way of using TON.\n\nFor the last two years, many TON enthusiasts have dreamed of seeing their favorite cryptocurrency integrated with the messenger app. Such projects as TeleTON allow you to see how Telegram could look if SEC (The Securities and Exchange Commission) did not halt Telegram Open Network.\n\nDuring the conversation with The Daily TON, one of the project’s developers shared that the team stopped working on the project as it did not find any interest on the part of the TON authorities. According to the GitHub repo, the app was updated in March last time. However, if people are interested in the project, the development team is ready to update the app and release it on App Store.\n\nIf you have any questions, feel free to reach us via our bot.\n\nUPD: you can see a full video demo on this channel","id":153,"poster":"./images/posts/153.jpeg"},{"message":"What if…?","id":152},{"message":"Getgems kicks off a new NFT launchpad\n\nBefore the minting process, every NFT project on TON went through several challenging stages, including an advertising company, attracting the audience, and presale. This initial process of creating an NFT collection has always been difficult for the user. Usually, all the information about the collection and the ways to buy it was dispersed on different Telegram posts, bots, or even sites.\n\nA new solution made by Getgems solves this problem: Today, the marketplace has unveiled the first NFT collection by Stickerface on their brand-new launchpad. On a launchpad’s page, users can maintain information about the project, including its roadmap, team, project links, and much more.\n\nMore importantly, there you can buy NFTs right before the mint. In other words, you do not need to use external Telegram bots to purchase the artwork in advance. Although it does not secure NFT enthusiasts from further price drops, buying digital assets will definitely become easier.","id":151,"poster":"./images/posts/151.jpeg"},{"message":"Tonspace.co, a new documentation site about TON\n\nLike every serious blockchain, TON has a documentation page for beginners to learn the basics of the blockchain and get started. For a long time, the official documentation site had not received new updates (both in terms of design and new information), but, fortunately, Tonspace.co, a community-driven documentation website, has recently come into play, providing a new standard of how TON wiki should look like.\n\nThe site developer adds both the old information presented on the official documentation page and the new one created alongside the TON Footsteps program. Now, tonspace.co consists of different articles that might be useful for crypto enthusiasts as well as developers. It is worth mentioning that our recent article devoted to the commission on TON has also appeared on the website.\n\nWe hope to see the developer continue working on the site, making it one of the most user-friendly wiki pages about The Open Network.","id":150,"poster":"./images/posts/150.jpeg"},{"message":"Bogdanoff: a meme bot to track Pavel Durov’s posts\n\nIt is well-known that every time Pavel Durov mentions TON, it increases in price. A group of TON enthusiasts suggested the idea of creating a bot that will always track a new Telegram’s CEO posts by chosen words and immediately buy Toncoin on a centralized exchange. Inspired by a popular meme – the Bogdanoff brothers – an active member of the TON Community and TON Punks, @dioqp9 created a bot to make money on Durov’s posts. \n\nAccording to the developer’s Telegram channel, users will immediately receive a message if a new post on @durov appears. Moreover, users can connect their OKX account and choose how much Toncoin they want to buy in such cases. \n\nTo activate the bot, you need to type “hello” to the bot. Anyone with a digital asset from the TON PUNKS’ NFT collection may use the bot.\n\nThough the bot was created jokingly, it is still a good project to attract one’s attention. We are delighted to see more and more enthusiasts build new projects on The Open Network.","id":149,"poster":"./images/posts/149.jpeg"},{"message":"Steve Yun participated in AMA-session with Huobi\n\nToday, the TON Foundation founding member Steve Yun had an interview with Huobi on Twitter Space. During the AMA session, Steve shared some thoughts about TON's perspectives on the occasion of the upcoming token listing on the crypto exchange. To keep more people informed, we chose some interesting points that Steve mentioned in the interview.\n\nAccording to Steve, the relations between different projects on TON (e.g., crypto wallets and marketplaces) provide a more user-friendly environment to use products within the blockchain ecosystem — one of TON's features is simplicity.\n\nOf course, even could not pass without questions about integration into Telegram. Steve believes strategic partnerships can be essential for both the blockchain and Telegram. The messenger has a large audience (more than 700 million people), which can easily grow in the future. For TON, it's another chance for mass adoption. \n\nTON Foundation is constantly working on attracting experienced developers through contests, grants, and conversations with different teams.\n\nFinally, Steve Yun has confirmed that the TON Blockchain will participate in the upcoming Token2049 in Singapore.\n\nThanks to Deep Ton for carefully listening to the AMA session.","id":148,"poster":"./images/posts/148.jpeg"},{"message":"LG is creating a NFT marketplace\n\nLG Electronics, a powerhouse based in South Korea, announced the launch of the NFT marketplace. The upcoming update will allow users to access the Hedera blockchain to buy and sell Non-Fungible tokens in front of LG’s smart television sets.\n\nEarlier this year, LG unveiled plans to incorporate digital assets at a press conference, following its competitor, Samsung Electronics. Three months ago, the tech giant had partnered with an Ethereum marketplace, Nifty Gateway. Back then, it intended to collect data from various marketplaces and represent information about artworks.\n\nThe Non-Fungible tokens continue to integrate on a daily basis step by step. Over the past six months, TON has made great strides to popularize non-fungible tokens technology within the blockchain.","id":147,"poster":"./images/posts/147.jpeg"},{"message":"A new update of Tonkeeper\n\nTonkeeper, the most popular non-custodial wallet in the TON ecosystem, just released a new update, bringing several highly-wanted features. Developers introduced the integration with .ton domains and unveiled a new transfer interface.\n\nMore than a month has passed since the start of the open auction on The Open Network. For a long time, the only way to pair a recently-purchased domain name to the TON address was using dns.ton.org with the installed Chrome extension. Now, every TON user can directly link a .ton domain with their account.\n\nWhat is more exciting is that the Tonkeeper team updated the transfer UI. With a new redesigned transfer screen, users can choose what token they want to transfer (native Toncoin or jetton) and see what amount of TON in fiat they are sending.\n\nWe believe today's update is essential for a better user experience. Hope to see that Tonkeeper will continue to work with feedback and make improvements if crypto wallet users find any bugs and drawbacks.","id":146,"poster":"./images/posts/146.jpeg"},{"message":"Huobi Global will list Toncoin\n\nHuobi Global, a Seychelles-based cryptocurrency exchange, now offers spot trading in the TON/USDT pair. Huobi Global is one of the world’s leading crypto exchanges, with more than 10 million clients and community members in a myriad of countries, including Thailand and Japan.\n\nIt is worth mentioning that Huobi Incubator, a part of Huobi Global incubator company, has recently become partners with the first $250-million TON fund. One of the first projects invested by TONcoin.fund was Fanzee, a fan engagement platform. \n\nListing on Huobi Global is a crucial step for the entire TON ecosystem – crypto exchange’s followers in over 130 countries now can easily buy and sell Toncoin.\n\nNow, looking forward to listing on B-name crypto exchange.","id":145,"poster":"./images/posts/145.jpeg"},{"message":"Trade your NFTs in a decentralized way\n\nFoxTails – a TON-based social network – introduced the first NFT swap service on the TON Blockchain. The feature became available for all social network users – they can choose a person to trade Non-Fungible Tokens with. Moreover, you can set your own price for the NFT buyback. According to the project, the swap service is built safely through smart-contract, so you can not get scammed during the trading.\n\nCurrently, the service takes a 0.5 TON fee per every participant of the trade offer, however, it is still much more cost-effective than selling NFTs on large marketplaces (e.g., Getgems and Disintar both take a 5% fee per every deal).","id":144,"poster":"./images/posts/144.jpeg"},{"message":"MyTonWallet: a new browser wallet\n\nIn the last interview, the core developer of TON Foundation, Tolya-yanot, mentioned several browser crypto wallets that were in development. Fortunately, one of them, MyTonWallet, has appeared today. Following a trend, most crypto wallets now strive to support NFTs as well as community-made tokens called jettons. Such features have stayed available only for iOS and Android devices until recently.\n\nWith MyTonWallet, users can see their Non-Fungible tokens and transfer jettons in a browser version. As can be seen, the classic TON Wallet inspired developers to build the application interface, so it remained as intuitive as before but with a couple of new features. Like TON Wallet, it also supports TON Magic, meaning you can transfer Toncoin in the Telegram WebZ version. And most importantly, MyTonWallet also has the Chrome extension version.\n\nThe TON ecosystem continues to see new developers building products alongside crypto-enthusiasts new to the blockchain.","id":143,"poster":"./images/posts/143.jpeg"},{"message":"A new TON bonus program on Stack Overflow\n\nLast week TON Foundation announced the launch of the TON tag on a popular question and answer website, Stack Overflow. Today, TON Society unveiled a bonus program for active platform members: everyone may take an active part in answering various questions and be rewarded, starting with 30 and up to 300 Toncoin. \n\nTON Foundation intends to create a TON knowledge library of replies to questions for new developers who want to create projects on TON. Usually, all the communication between programmers takes place in TON Dev Chat, where the exact solutions to problems get buried by new and new questions. Using Stack Overflow instead of gaudy Telegram chats may be an excellent decision to create a new standard for resolving issues.\n\nEvery month TON Society will reward the top 10 most active people who answer questions as well as the top 3 questions. It will also launch a Telegram bot to provide one's TON address in the second half of September. Сommunity members can use the website to create questions and answers, starting tonight.","id":142,"poster":"./images/posts/142.jpeg"},{"message":"TON Society introduced WTON\n\nYesterday, TON Society published the update post and mentioned recently appeared wton.dev. The site provides a gateway to wrap native TON tokens. According to the information posted on wton.dev, wrapped assets allow token holders to participate in DeFi and program smart-contracts.\n\nInitially, wrapped assets were created to use cryptocurrencies in other blockchains. Wrapped TON token is a jetton fully backed with native crypto made on the TON Blockchain that will help to solve the problem of blockchain interoperability.\n\nIt’s worth mentioning that a different team, Tonox, made the first attempts to create wrapped tokens. Unfortunately, the project seems closed, and wton.dev can be its spiritual successor.\n\nUPD: Tonox isn't closed and is still in development. Soon, there should appear dApp for WTON and TOX Jetton, according to the Telegram post.","id":141,"poster":"./images/posts/141.jpeg"},{"message":"62% of all Bitcoin owners didn’t sell BTC for more than a year\n\nTipRanks, a company that represents visual infographics about different stocks and also Bitcoin, indicated that 62% of the world’s popular crypto holders didn’t sell BTC despite the so-called crypto winter. At the same time, more than 30% of investors interact with their crypto wallets between one month and 12 months as of September 1. \n\nUpcoming September is the worst month for Bitcoin as it happens. According to a Bloomberg report, BTC has registered a drop every September since 2017. A potential price drop will lead to even more dip in the cryptocurrency market. Though historically, September is a choppy month for crypto, Bitcoin’s price can rise during the following fall months.","id":140,"poster":"./images/posts/140.jpeg"},{"message":"Vitalik Buterin’s book will be released soon\n\nEthereum co-founder Vitalik Buterin recently announced his new book on Twitter. The book titled “Proof of Stake” comes on September 27, two weeks after the eagerly awaited Ethereum Merge. Readers can get signed digital copies and NFTs on the Gitcoin platform. \n\nAccording to Buterin’s Twitter announcement, the book represents the compilation of various writings made over the last ten years. Vitalik’s work is releasing at the right time since many people don’t clearly understand how Proof-of-Stake consensus works. \n\nAn upcoming Merge is a significant event in blockchain’s history. It allows Ethereum to move from a proof-of-work model to a proof-of-stake one, setting the stage for future upgrades that could increase the blockchain’s scalability.","id":139,"poster":"./images/posts/139.jpeg"},{"message":"The .ton domains became cheaper\n\nExactly a month ago, TON DNS auction started. August brought us high-profile deals, including purchases of wallet.ton and casino.ton domains for more than 400,000 Toncoin in total. The start of the auction undoubtedly attracted the views of every TON enthusiast – even Pavel Durov noted the success of the recently launched sale.\n\nAs it should be, the base price on domain names has decreased by 10%. Starting today, the floor price has become 9 TON instead of 10 TON and 900 tokens for four-letter domains instead of 1,000 Toncoin. According to TON DNS auction rules, domains' prices will decrease gradually for the next 11 months. Now, it's your turn to decide whether you need to buy the domain name now or wait until the price decreases even more.","id":138,"poster":"./images/posts/138.jpeg"},{"message":"Formula 1 has plans to release NFTs\n\nFormula One, a high-class international auto racing sport, is diving deeper into Non-Fungible tokens. Racing behemoth recently filled two trademarks related to cryptocurrencies and digital tokens for the Las Vegas Grand Prix event, scheduled for November 2023.\n\nAs per reports, Formula One will sell sporting equipment, headphones, lanyards, souvenirs, keyrings, digital art, and other items in the form of NFTs. Several Formula 1 teams are adding cryptocurrency-related branding on sports cars lately, including McLaren’s partnership with crypto giant FTX. The race team and crypto exchange have created a series of special NFT collections, one of which represents free-to-claim digital tokens created by the world’s leading artists.","id":137,"poster":"./images/posts/137.jpeg"},{"message":"The details of the interview with Fanzee\n\nYesterday, I love TON, a sizeable Russian Telegram channel, interviewed Tonstarter’s and Fanzee’s co-founders. The AMA session attracted views of many crypto-enthusiasts ready to ask plenty of questions. The project’s leaders discussed the roadmaps of projects, ways to attract new audiences, and much more. It is not the first time we have mentioned Fanzee – check out our recent post to learn more about it.\n\nSerge Suchkov, Fanzee’s co-founder, said that more than 25 people are currently working on the project. Half of them are developers building new mechanics; another is a group working on establishing agreements with sports clubs worldwide. Another interesting fact is that Fanzee has a fully-international team, including employees from the UK, Russia, and other parts of the world. The team strives to build a new communication model between sports clubs and their fan base in the blockchain space.\n\nUpcoming IDO is a great chance to bring in investors from the blockchain and sports space. According to Tonstarte’s project page, the initial price per FNZ token will be $0.02 on the token sale. As we know, Fanzee will soon release news on recently signed agreements with famous sports clubs.","id":136,"poster":"./images/posts/136.jpeg"},{"message":"Iconic American rappers will perform an NFT-related song\n\nIn the following hours, two rap legends – Snoop Dogg and Eminem – will perform “From the D 2 the LBC” on the MTV-sponsored Video Music Awards (VMAs). It is worth mentioning that the recently released music video featuring Bored Ape Yacht Club (BAYC) is the first collaboration between artists in 20 years. The BAYC holders will be allowed to watch the event live on the metaverse called “Otherside.”\n\nThe Otherside is a collaboration project between Yuga Labs, BAYC’s creator company, and NFT investment giant Animoca Brands. Both Snoop Dogg and Eminem have been NFT enthusiasts for a piece of time and bought the Non-Fungible tokens from the BAYC collection last year.\n\nIn addition, The 2022 MTV Video Music Awards have also added a “Best Metaverse Performance” category to its annual awards. Among the award nominees there are Justin Bieber, Rift Tour, and Twenty One Pilots.","id":135,"poster":"./images/posts/135.jpeg"},{"message":"Interview with Disintar's co-founder\n\nToday, TON_Learn, a Telegram channel focused on creating tutorials for smart-contract developers new to TON, published an interview with Andrey Tvorozhkov, a Disintar co-founder. We chose several answers that we found interesting and worth mentioning. Check out the full interview through this link.\n\nThe history of Disintar began on December 21 when Andrey was thinking of a present for his friends. Though he originally planned to mint an NFT on the Ethereum Blockchain, he changed his mind after Pavel Durov said support to TON. Disintar was the first-launched NFT marketplace on TON. Until Getgems came into play, the marketplace took the lead by volume trading. According to Andrey's words, Disintar has earned six figures dollars since it was launched. \n\nThe developers faced a myriad of problems on their way to building a project, including the TON technology's unfinished condition and the TON Foundation's unwillingness to support newcomers. Though Andrey admitted, the situation became a bit better. Disintar's current goal is to make TON more accessible to more users in every sense of the word. The team plans to introduce new stuff and products, some of which will be NFT-related.\n\nYou can always reach us via our bot if we've missed something.","id":134,"poster":"./images/posts/134.jpeg"},{"message":"Half of the daily Bitcoin trading is fake\n\nThe volume of traded cryptocurrencies on exchanges has always been controversial, as some people consider it bogus. A recent study by Forbes confirms that more than half of Bitcoin traded daily is fake data. The business magazine came to this conclusion by analyzing volume data from 157 crypto exchanges.\n\nAccording to Forbes, \"the global daily bitcoin volume for the industry was $128 billion on June 14. That is 51% less than the $262 billion one would get by taking the sum of self-reported volume from multiple sources.\" In addition to Bitcoin trading data analysis, the business magazine figured out the most popular centralized exchanges by trading volume of Bitcoin – Binance is a clear leader with 27% market share, followed by FTX and OKX.","id":133,"poster":"./images/posts/133.jpeg"},{"message":"Ethereum Merge date was announced\n\nThe views of the entire crypto community are focused on the upcoming Merge of the Ethereum Blockchain these weeks. Finally, Ethereum Foundation announced the official date of the eagerly anticipated milestone. According to the official blog post, the mainnet migration to a proof-of-stake network will complete between September 10 and 20 with the Bellatrix upgrade. The developers say that the estimated date is so broad as it depends on hashrate, which is volatile.\n\nAfter the update, the only way to create a new ETH will be to stake pre-existing coins on the blockchain network. Now, Ethereum lives out the final days on a Proof-of-Work consensus. In contrast to a much-talked Proof-of-Stake, it requires spending large amounts of energy to keep the network secure.","id":132,"poster":"./images/posts/132.jpeg"},{"message":"A new contest by The Open Network\n\nRecently, the TON Contest channel announced the launch of the first TON Design challenge. Unlike many other competitions held by TON Foundation last month, this one seeks illustrators ready to create at least two animated stickers.\n\nAccording to the official announcement, the participants have to introduce relevant to the TON community stickers, one of which features TON’s logo. By September 21, TON Contest team will pick winners and offer them to complete sticker pack.\n\nIt is the first time that competition is not associated with writing the code. Previously, TON Foundation launched a series of contests for smart-contract developers, including TON Smart Challenges and Hack-a-TON.","id":131,"poster":"./images/posts/131.jpeg"},{"message":"M&M partnered with Bored Ape NFT Band\n\nYesterday, NFT music group KINGSHIP announced a collaboration with an eminent American multinational manufacturer of confectionery, Mars. The candy brand and music group deal enables the creation of a limited edition of M&M, featuring a few Bored Apes.\n\nThis became possible thanks to the permissive commercialization right of Bored Ape Yacht Club owners to exploit their NFT images commercially. They can turn them into everything they want – clothes, brands, and now even food.\n\nKingship is a metaverse group created by Universal Music Group last year. A virtual band consists of three apes and a mutant monkey – all of them are digital assets minted on the Ethereum Blockchain. Earlier this year, Kingship released a collection of 10,000 Key Cards in the form of NFTs that used to access the group’s virtual world and unlock their music.","id":130,"poster":"./images/posts/130.jpeg"},{"message":"Gameswift announces partnership with Polygon\n\nGameswift, a decentralized and community-driven gaming platform, partnered with one of the most famous blockchain networks worldwide, Polygon. According to the official announcement, the new partners plan to build a decentralized version of Steam.\n\nFormerly known as StarTerra, Gameswift is going to introduce the tools for game developers and studios to launch Web2 games into the Web3 environment. It will give players a fantastic gaming experience with an ultra-low transaction fee. As a decentralized ecosystem, Gameswift’s mission is to provide a simple blockchain onboarding process for all blockchain newcomers. Meanwhile, Polygon granted Gameswift to make the ecosystem the first choice in terms of web3 gaming on the blockchain.","id":129,"poster":"./images/posts/129.jpeg"},{"message":"How TON made a buzz\n\nYou must have heard about recent Pavel Durov's post and his plans to partly integrate TON on Telegram by selling t.me/ usernames for crypto. We won't stop on his post itself and would better see and analyze what buzz it made on social media.\n\nSeveral leading news outlets, including Decrypt and Cointelegraph, have already written articles mentioning The Open Network and its successful launch of TON DNS. In the only case of Decrypt, more than 3 million people visit it every month. TON declared itself a promising cryptocurrency that will likely get integration into Telegram shortly.\n\nAnd now let's remember our recent post, which tells about VK's plans to integrate NFT into the social network. We believe TON may also receive an integration there, especially considering the strong connections between some development teams on The Open Network and VK. \n\nAt the time of writing, TON's price has already increased by 30%. Even if the price goes down, we now definitely know that Pavel Durov, like other crypto influencers around the globe, keeps an eye on The Open Network.","id":128,"poster":"./images/posts/128.jpeg"},{"message":"Nike generated $185 million via NFT Sales\n\nNike, a popular sports clothes brand, earned astonishing dollars from selling non-fungible tokens (NFT). Dune Analytics reports that the secondary market of Nike NFTs has generated $1.3 billion in total transaction volume. For the whole time Nike NFT has been around, it has earned $92 million, including royalties and main sales.\n\nWell-known companies, including D&G, Gucci, Tiffany & Co., and Adidas, recently started entering the NFT industry back in 2021 at the peak of popularity. Despite the number of companies entering metaverse, Nike leads the way, ranking higher than the others in terms of earned money.","id":127,"poster":"./images/posts/127.jpeg"},{"message":"Fanzee is getting ready for the first IDO\n\nRecently, Tonstarter – the first launchpad on TON – started a countdown to the official announcement of the first project that will have the inaugural token sale on TON. Now, that day has come, and we know its name – Fanzee.\n\nLast month we wrote that a fan engagement platform raised $2 million from TONcoin.fund. Fanzee plans to revolutionize the whole idea of how people interact with their favorite sports teams and players. The project will deploy a sea of different mechanics, including rewards-based quizzes and NFT tickets.\n\nCurrently, it is the first such technologically-advanced project on TON that drew the investors' attention worldwide. We hope it will delight sports lovers as well as the first investors.","id":126,"poster":"./images/posts/126.jpeg"},{"message":"Insides on the future of TON\n\nLast week brought us a lot of intriguing information on TON's future development and its implementation in mass-market products. Let's dive deeper and find out everything that has happened lately.\n\n– TON Foundation is considering investing Binance Blockchain Week 2022 in Paris and Token2049, the largest crypto event in Asia. The entire TON Community looks forward to TON's listing on well-known exchanges, including Binance. Event sponsoring can be a step towards this eagerly anticipated day.\n\n– Tonkeeper's Support member Denis Matveev shared the product's plans to \"make something interesting and powerful for desktop users.\" Currently, there is a lack of Google Chrome extensions that supports TON native network. And we hope Tonkeeper will remedy it, or at least create decent analogies of rarely-updated desktop wallets.\n\n– Some private chats started spreading information about upcoming TON integration into Trust Wallet, one of the most popular crypto wallets worldwide. Only time will tell if it is true.\n\nAs the TON community, we hope all of these insides will come to life one day.","id":125,"poster":"./images/posts/125.jpeg"},{"message":"KFC begins its journey in metaverse\n\nKFC India, a well-known fast food restaurant unit, announced the launch of the first NFT a few days ago. According to the official Twitter account, the NFT owner will win ownership of the KFC BuckETH Non-Fungible token as well as a year’s supply of KFC products. Notably, the fast food restaurant also chose the iconic red and white colors and the white striped bucket as the face of its digital token. \n\nKFC says this NFT will be a one-of-a-kind single collectible minted on the Ethereum Blockchain. For the Non-Fungible Token production, the artists across India came together to create the digital token inspired by the anniversary of the brand’s achievement of 600 restaurants in 150 cities across the country. To enter the NFT contest, a person must visit KFC India’s Instagram page and follow the instructions on the account’s Stories.","id":124,"poster":"./images/posts/124.jpeg"},{"message":"Uniswap blocked more than 250 crypto addresses\n\nDecentralized exchange Uniswap has recently blacklisted 253 addresses linked to money-laundering or sanctions. Most of the blocked addresses were related to under-sanctioned firms, including Tornado Cash, which recently came under the US Treasury sanctions.  For Uniswap, it was the first time the company made blacklisting data public. According to a Twitter user, some blocked addresses don't have a criminal history, as they were used as an alternative burn address. Moreover, 12% of blacklisted addresses have an ENS domain, meaning – more likely – they belonged to legitimate users that have fallen unfair damage.\n\nUniswap is not the only one company freezing crypto addresses. Meanwhile, Tether, a USDT issuer company, remains in the lead with more than 700 banned addresses. According to statistics, 407,590,988 USDT was frozen since 2017. Interesting fact: Blocked funds can be used in a \"recovery mechanism\". For example, if a user sends USDT to the wrong address, it can help recover it by freezing the USDT sent to the wrong address and reissuing a new USDT to the user.","id":123,"poster":"./images/posts/123.jpeg"},{"message":"The first IDO on TON is coming soon\n\nTonstarter, a well-known launchpad on The Open Network, will announce the first project on Monday, August 22. According to the official project’s Telegram channel, the team are making the final preparations to tell the whole TON Community what product has become worthy of being the first one on the first IDO on TON ever.\n\nLaunchpad’s goal is to allow blockchain-based projects to raise funds while giving away access to early-stage token sales. With Tonstarter, many developers can reach an audience ready to invest in an ambitious project.\n\nThe first IDO is an essential milestone for the entire TON community. We believe it will promote the TON Blockchain even further.","id":122,"poster":"./images/posts/122.jpeg"},{"message":"Tether is going to release reports monthly\n\nTether, the world’s largest stablecoin issuer, has recently switched the accounting firm that audits the cryptocurrency. Previously, Cayman Islands firm MHA Cayman was releasing attestation reports every three months, which now will be released monthly. According to Tether, with a new accounting firm BDO Italia, the company gets one step closer to its path toward a complete audit and transparency.\n\nMHA Cayman published a recent May report showing that USDT stablecoin is fully backed. However, as the company continues to face questions about what its USDT token is actually backed by, Tether is reducing the amount of riskier commercial paper in its reserves. Recently, the company is also announced its plans to reduce the amount of commercial debt in its accounts.","id":121,"poster":"./images/posts/121.jpeg"},{"message":"Anthony Hopkins will create an NFT Collection\n\nAnthony Hopkins, a famous Welsh actor cast in many cult movies, including The Silence of the Lambs and Hannibal, has decided to launch his own NFT collection. Last year, Hopkins participated in Zero Contact film released in the form of NFT on Vuele. Back then, the famous artist started interesting in creating the NFT collection.\n\nOn August 17, a Hollywood actor announced the partnership with Orange Comet to launch his first NFT collection, The Eternal Collection. According to Hopkin’s Twitter account, he took part in creating the collection by referencing and conceptualizing a character. The artist is going to sell 1011 pieces of art.","id":120,"poster":"./images/posts/120.jpeg"},{"message":"The update of custodial wallets\n\nAlthough non-custodial wallets have many features, including greater security, the custodial ones can boast of deeper integration into Telegram or a wide range of use. A well-known custodial @wallet bot has recently kicked off a fresh update that improves the web app’s interface making it more user-friendly. The developers have integrated the transaction feed – now, it is easier than ever to see who sent you TON recently. And another hot feature: you can top up your in-bot balance within the web-app interface – just click on the Buy Toncoin button. \n\nMeanwhile, TON Rocket bot has become even more delightful to use recently. Bot’s kill feature is a support of jettons issued on the TON Blockchain – using @tonRocketBot, you may buy or sell them with Toncoin. With a recent update, the process of purchasing jettons has become much handier. \n\nThe TON ecosystem continues to see more and more essential updates to make the user experience as convenient as possible. If you have some questions, please, contact us via our bot.","id":119,"poster":"./images/posts/119.jpeg"},{"message":"Ripple continues to explore Asia\n\nYesterday, Ripple, a top-seven cryptocurrency on Coinmarketcap, announced a new partnership with Japan's SBI Remit and Siam Commerical Bank. With RippleNet technology, Thai nationals living in Japan can send money home faster and safer instead of using local agents to retrieve cash. Now SBI Remit's customers can use ATMs to send money to saving accounts in Thailand instantly.\n\nIt is not the first time Ripple cooperates with large Asian companies. Last month, Ripple and a prominent Singapore-based Fintech FOMO Pay teamed up to provide low-cost and cross-border payments to their customers in US dollars and euros. In response to progressive crypto regulation in the APAC region, the business shows a steady interest in cryptocurrency adoption and the digitization of money there. It results in the implementation of cryptocurrency technologies in daily life. According to recent company research, 76% of financial institutions and 71% of enterprises will start using blockchain technology by 2025.","id":118,"poster":"./images/posts/118.jpeg"},{"message":"Souldbound's contract is completed\n\nThe buzzword \"soulbound\", which recently came to the NFT world by Vitalik Buterin's contributions, is about to appear on The Open Network space. Today, Getgems has announced the ending of the work on the first draft of the Soulbound NFT Standard. Last month, we described in more detail what it is and why it is so essential for the entire ecosystem – check it if you somehow missed it before.\n\nEarlier in June, the marketplace started searching for developers who will deliver a brand-new NFT Standart on TON. The grant sum was originally 1,000 TON; however, thanks to TON PUNKS, this amount was increased by twice. After a long time, Getgems finally came up with a draft of the standard. According to their official channel, the marketplace is looking for public discussion by the developers across the TON ecosystem to send a new standard to the TON Foundation for approval.\n\nAs soon as the Soulbound NFT Standard gets approval from the TON Foundation, it will be implemented on Getgems.","id":117,"poster":"./images/posts/117.jpeg"},{"message":"Tonana announces new swaps for TON\n\nTonana, a software organization that launched its DeFi Hub on TON, has shown upcoming updates on Tonana Bridge. TON Grant recipients strive to create Wrapped NEAR token on The Open Network as well as Wrapped TON on NEAR Protocol. According to a recent post in their channel, the developers are sure that an upcoming update \"will help our partners to start using wTON, wNear in their DEXs, NFT, and any other projects“.\n\nThe team have already kicked off a swap tool to exchange TON to Solana and NEAR and vice versa, eluding the centralized exchanges. Recently, Tonana Bridge received a 5293 TON grant from TON Society to make the user experience more delightful and – more importantly –  take the first steps to unite all blockchains into one network.","id":116,"poster":"./images/posts/116.jpeg"},{"message":"Revolut will operate across the EU\n\nRevolut, the European digital banking firm, received a green light to operate in a great number of countries across Europe from Cyprus regulators. Now, a company is able to offer crypto services to its 17 million customers. Crypto firms continue establishing local entities in European countries to ensure they may offer their services across the economic bloc.\n\nIt is not the first time that the large crypto companies have preferred the regulatory regime of Cyprus – the island has already attracted Crypto.com, Bitpanda, and eToro. According to Revolut's spokesperson, the company has picked Cyprus for its \"sophisticated and robust\" regulations after an \"in-depth survey of all EU countries“.","id":115,"poster":"./images/posts/115.jpeg"},{"message":"Validators vs Nominators\n\nIf you are familiar with cryptocurrencies, you must have heard about validators and nominators. These words often appear in crypto-related channels (our channel isn't an exception). Now, the time has come to find out who they are – the two major actors ruling the blockchain.\n\nFirst, let's speak about validators. A validator is a network node that helps keep the blockchain running by verifying (or validating) suggested blocks and allowing to record them in the blockchain. To become a validator, you must follow two requirements: have a high-performance server and obtain a serious amount of TON, 600,000, to make a stake. At the time of writing, there are 227 validators on TON.\n\nIt's evident that not everyone can afford to have hundreds of thousand Toncoin on their balance – that's why nominators come into play there. Simply put, the nominator is a user who lends his TON to validators. Every time the validator earns the reward by validating blocks, it is distributed between the involved participants.\n\nSome time ago, Ton Whales ran the first staking pool on TON with the minimum deposit of 50 TON. Later, TON Foundation launched the first open nominator pool. Now, users may stake Toncoin in a fully-decentralized way, starting with 10,000 TON.","id":114,"poster":"./images/posts/114.jpeg"},{"message":"Nigeria is curious about crypto\n\nA recent study by CoinGecko showed that Africa’s most-populous country, Nigeria, is more interested in crypto assets than other nations. The investigation conducted on Google Trends data determined that Nigeria (with a score of 371 points) occupies the first spot as the most crypto-curious nation. Meanwhile, the United Arabian Emirates and Singapore scored second and third, respectively.\n\nDespite the market dip, cryptocurrencies are still in demand in many African countries. The Nigerian stock exchange introduced in June plans to start a blockchain-based platform next year. At the same time, the Central African Republic began selling Sango Coin just after Bitcoin’s legalization.\n\nAfrica is still attracting investors’ attention for its attempts to integrate the blockchain’s solutions into daily life. Not so long ago, some African countries mentioned that they are in talks with The Open Network to launch stablecoins.","id":113,"poster":"./images/posts/113.jpeg"},{"message":"Top football clubs filled a joint on metaverse trademarks\n\nOne of the most popular football clubs worldwide – FC Barcelona and Real Madrid – have filed a joint crypto-based trademark application. The football giants are to gratify their fans with virtual reality gaming, digital clothing, and cryptocurrency transaction management software, said patent attorney Mike Kondoudis.\n\nSpanish powerhouses decided to shake hands despite being rivals on the football field and continue exploring metaverse together. Lately, FC Barcelona had an experience entering the crypto universe in November last year. Back then, it partnered with the NFT marketplace Ownix to create digital collectibles.\n\nRecently, Fanzee, a fan engagement platform on TON, raised $2 million in investments to \"change sports with a unique intersection between blockchain and fan engagement.\" According to the project's Notion page, it is on the way to partnering with an array of cybersport teams, including B2ru and HellRaisers, as well as football clubs.","id":112,"poster":"./images/posts/112.jpeg"},{"message":"VK is set to expand in Web3 space\n\nVkontakte, a popular Russian social network developed by Pavel Durov, announced a huge app update. According to the official press release, the media giant will launch a myriad of test features, including web3 and NFTs support. Recently, VK made the first steps towards a new update: the news feed has become much more user-friendly and convenient.\n\nEarlier this winter, the technical director of the platform, Alexander Tobol, said in an interview that NFTs would be used to monetize user-generated content and protect copyrights. He also confirmed that VK would not create its own blockchain, rather acting as an intermediary and assistant.\n\nThough it is still unknown what blockchains VK will support to integrate the NFTs features, interestingly, many developers working on the TON ecosystem have come from Vkontake's projects, e.g., Getgems.","id":111,"poster":"./images/posts/111.jpeg"},{"message":"NFTs are still in demand\n\nCryptoPunks, an extremely famous NFT collection on the Ethereum blockchain, is still attracting the attention of crypto enthusiasts worldwide. Recent data shows that trading volume for CryptoPunks skyrocketed by some 25% over the last days. Meanwhile, Punk #8576 is the most expensive sale during the period.\n\nThirteen purchases of CryptoPunks were made in the last two days, representing a solid $1.7 million of NFTs traded at the time of writing. Keep in mind that the floor price for CryptoPunks the previous week was about 75 ETH. \n\nCryptoPunks is a trendy NFT collection with 10,000 items minted on Ethereum. It was launched in mid-2017 and became very popular over the last years, featuring in places like The New York Times and Christie’s of London.","id":110,"poster":"./images/posts/110.jpeg"},{"message":"Cryptobot’s market update\n\nRecently, Cryptobot – a powerful tool to buy TON with P2P in a safe way – released a new update that makes the process of purchasing and selling crypto assets much easier and more convenient. In the last update, the Cryptobot team added different filters to choose the buyer (or the seller) to buy TON from.\n\nNow, if you are to sell some TON via the bot, you may set the criteria – the number of completed transactions and the total volume of all trades. Moreover, one can even sell crypto assets only to those subscribed to Telegram Premium. The filters are designed to reduce the number of scam offers in the market.\n\nThis week Cryptobot also started accepting some bank cards issued in Uzbekistan as well as the national currency – soms. More and more people begin to feel the benefits of using Peer-to-Peer exchange platforms. We hope Cryptobot will continue to kick off new features and expand coverage of regions that can use it.\n\nUPD: Georgian lari now are also supported","id":109,"poster":"./images/posts/109.jpeg"},{"message":"Spam transactions on TON\n\nUnlike many other blockchains, TON is capable of performing thousands of transactions per second with meager fees. Despite this considerable advantage, it leads to a severe problem within the blockchain – spam attacks.\n\nMore likely, you've already seen these incoming transactions to your wallet saying: \"Congratulations! Your wallet can become a validator. Send 50 or more TONs to…\". Obviously, it's a scam, and under any circumstance, don't transfer your funds to such crypto scammers. Unfortunately, TON is an open network, and we cannot \"turn off\" the spam messages, so the only way not to get into trouble is to ignore them.\n\nLuckily, some wallet apps, e.g., Tonhub, enrolled a new feature protecting crypto beginners against spam attacks. The app will hide all the comments in the transaction feed if the number of sent cryptocurrencies is under 0.1 TON. \n\nBe cautious and do not land on the hands of scammers!","id":108,"poster":"./images/posts/108.jpeg"},{"message":"A new product to track crypto assets movement\n\nElliptic, a blockchain analytics firm, said they developed a tool to track all crypto movements across different blockchains concurrently and in a matter of milliseconds. Elliptic’s product name is Holistic Screening and can be a milestone in a long history of tracking various stolen funds between all blockchains. \n\nDecentralized cross-chain bridges and exchanges become a powerful tool to launder illicit funds. With Holistic Screening, regulators can track funds in an automated and scalable way that is much faster than manual investigations.\n\nAccording to Tom Robinson, the Elliptic co-founder, the company had to build a new blockchain analytics engine, called Nexus, to make Holistic Screening possible. Thanks to it, now the company may trace the source or destination of funds through one asset within the same blockchain as well as multiple ones.","id":107,"poster":"./images/posts/107.jpeg"},{"message":"Iran made its first official order using cryptocurrency\n\nRecently, Reuters, a popular news agency, reported the first official import order made using the cryptocurrency by Iran. According to the media portal, the order worth was $10 million. It was a first step towards allowing the country to trade through digital assets beating the dollar-dominated global financial system to deal with other countries.\n\nCurrently, the United States bans all imports to Iran, including banking and shipping sectors. The US-sanctioned Iran may find a great alternative in cryptocurrencies to trade with other countries worldwide. Unsurprisingly, 4.5% of all bitcoin mining was taking place in Iran last year.","id":106,"poster":"./images/posts/106.jpeg"},{"message":"Another cryptocurrency mixer falls under sanctions\n\nYesterday, the US government banned Tornado Cash, an Ethereum-based virtual currency mixer. According to Brian E. Nelson, Tornado Cash was prohibited due to laundering the proceeds of cybercrimes, including those committed against victims in the United States. Following the US Treasury ban, Circle, USDC and EUROC issuer, reportedly has blacklisted Tornado Cash contracts. \n\nPreviously in May, blender.io was the first sanctioned digital mixer as it had links to North Korean hackers and was used to launder funds stolen from Axie Infinity. The US government continues to take action against illicit financial activities in the cryptocurrency world.","id":105,"poster":"./images/posts/105.jpeg"},{"message":"The number of crypto ATMs is rising\n\nAccording to coinatmradar.com, cryptocurrency cash machines have become increasingly popular worldwide. Now, their number has surpassed 39,000. Though almost all of them support Bitcoin, other cryptocurrencies are also becoming available on ATMs – you may swap fiat currency into Litecoin, Ethereum, and Dogecoin.\n\nThe web portal also indicates the number of ATMs installed over the last day. On August 8, the platform says that more than 11 ATMs are installed daily at the current rate. If the speed remains the same, in 3 months, the number of cryptocurrency ATMs will exceed 40,000.\n\nWe believe we will see TON available on ATMs one day.","id":104,"poster":"./images/posts/104.jpeg"},{"message":"TON Domains first week results\n\nThe first week since the auctions started has ended, and the first users receive their .ton domain names. We consider the .ton domain's launch one of the summer's most meaningful events, as it demonstrates that TON's ecosystem is not only about questionable NFTs but also something more. We are glad to understand that the community members have paid the ongoing auction so much attention and continue to discuss its terms and future. Let's revise the hottest news in recent days.\n\n– According to TON Community, more than 8000 auctions have started, and more than 2,400,000 Toncoin has been paid\n– Set the record for the most expensive the .ton domain: casino.ton was sold for 200,000 TON\n– Getgems started displaying bought domains in the form of NFTs\n– An array of instruments for auction monitoring was introduced\n– TON's price skyrocketed by 10-15 percent\n\nWe strongly believe TON Domains, as the TON Blockchain as a whole, have great potential to become extremely popular like all-known Bitcoin or Ethereum. With the TON Proxy & Sites introduction, the popularity of TON will increase considerably. Have your chances to capture hot domains!","id":103,"poster":"./images/posts/103.jpeg"},{"message":"A new award program\n\nYesterday, TON Society announced a new award program for teams developing products on TON. The primary condition for applying for the liquidity award program is to create a project increasing the total value locked TON in the ecosystem.\n\nAccording to the official channel, the program is aimed to provide an attractive way for teams to build bridges, DEX, and other DeFi Protocols on TON. Developers may get monetary awards ranging from $250,000 to even $3,500,000.\n\nNow, TON Society is inviting teams of developers to get feedback and questions on the terms of the program on Github. You may also participate in discussing the program by creating an issue.","id":102,"poster":"./images/posts/102.jpeg"},{"message":"Get your VISA card with TON\n\nPayC, a new tool for paying with cryptocurrencies, has recently been released. PayC is a Telegram bot that helps to get a virtual VISA card and make purchases on the Internet with TON.\n\nTo issue a new card, you only need to top up your in-bot balance and choose the number of dollars you want to create a card for.\n\nNote: you need to pay 5 TON as an extra fee for issuing the card.\n\nWith your virtual card, you can make purchases online across various American sites such as YouTube, Amazon, eBay, Spotify, and others.\n\nThe ecosystem continues to see more convenient services from independent developers that hugely promote the whole TON ecosystem.\n\nIf you get into trouble using this bot or have some questions, feel free to reach PayC’s support or contact us.","id":101,"poster":"./images/posts/101.jpeg"},{"message":"The Daily TON launches the Russian-speaking channel\n\nToday, the new chapter of The Daily TON begins. We are constantly following our audience and thinking of ways to satisfy our readers even more. According to the statistics, more than 30% of our subscribers speak Russian. We cannot ignore this fact, so we decided to launch the Russian-speaking channel.\n\nFor all of you enjoying posts in English, nothing will change – posts will keep appearing regularly on this channel. We see the launch as an outstanding opportunity to widen TON's community and promote the blockchain ecosystem.\n\nWe've already translated some of our recent posts into Russian for newcomers. Subscribe to The Daily TON RUS and stay up to date with everything on TON in Russian.","id":100,"poster":"./images/posts/100.jpeg"},{"message":"The culprit of the Solana attack\n\nRecently, we reported a hacker attack that targeted thousands of Solana users. Over the last few days, many speculations have been made on its culprits.\n\nSolana confirmed that the issue only affects Slope’s hot wallets. They also said there is still no evidence that hackers compromised the Solana protocol or its cryptography during the cyber attack. \n\nAccording to new reports, Slope held logging seed phrases on their servers – some people consider it the main reason for the data exposure of about 9000 wallets.\n\nThe investigations are still ongoing, and as soon as all attack methods have been ascertained, more detailed information will be published.","id":99,"poster":"./images/posts/99.jpeg"},{"message":"Gucci started accepting Apecoin\n\nToday, Gucci, the trendy Italian fashion house, has moved one step closer to cryptocurrency integration in the real world. A high-end fashion brand revealed that the Bored Ape Yacht Club (BAYC) token would be available as a payment option in various stores across the United States.\n\nApecoin is not the first digital asset that has become a payment option in Gucci’s stores. Bitcoin, Ethereum, Litecoin, and other well-known cryptocurrencies have recently become available for in-store payments.\n\nEvery day more and more famous companies and projects enter the new world of web3 technologies, despite the market downturn. We believe that prominent brands bring popularity to digital assets.","id":98,"poster":"./images/posts/98.jpeg"},{"message":"🎉 Giveaway winners\n\n…And the second giveaway by The Daily TON channel has finished! Here are the winners:\n\n@TapirPapir\n@drza5\n\nEach of them will receive NFT Tegro Dog shortly! Thanks to our partners – Tegro Team – who agreed to give us two beautiful NFTs. Stay tuned for more updates!\n\nIf you are ready to sponsor our future giveaways, please, contact us via our bot.","id":97,"poster":"./images/posts/97.jpeg"},{"message":"Solana suffers multi-million dollar hack\n\nToday, Solana – an increasingly popular blockchain for its speedy transactions – got in hackers’ crosshairs. The losses, so far, have been estimated to be around $9 million from over 8000 wallets. The number of compromised wallets is still increasing – around 20 per minute, according to Ava Labs CEO and founder Emin Gun Sirer.\n\nExperts warn users to transfer their funds onto offline cold wallets since hackers have targeted Solana-based wallets such as Phantom and Slope.\n\nSome users speculated that the attack could be linked to Magic Eden’s Solana-based NFT marketplace. If you use Phantom or Slope, consider sending funds to your hardware wallet or an exchange account.","id":96,"poster":"./images/posts/96.jpeg"},{"message":"STON.FI is looking for an alternative logo\n\nToday, STON.FI team has announced a new contest dedicated to decentralized exchange rebranding. During the competition, participants must develop a concept of a logo or a mascot that the project will use.\n\nEvery user may participate in the contest by minting their works on Getgems and applying it through a bot. By the end of the month, STON.FI will choose three winners whose works will be bought in the marketplace.\n\nUsers may find more detailed information on the terms of the contest and the awards for winners on the official channel of the project.","id":95,"poster":"./images/posts/95.jpeg"},{"message":"Binance launches first-ever Soulbound token\n\nBinance, the world's largest crypto exchange, is set to unveil the BAB token. The token is built on the BNB chain and belongs to a type of Souldbound tokens firstly proposed by Vitalik Buterin (recently, we've made a post about it). \n\nBAB is introduced to function as online verification for Binance users. Every user may mint the Soulbound token to their account if they pass the KYC verification. Now, third-party services can leverage tokens to verify the user's identity in a myriad of use cases, e.g., to airdrop NFTs to avoid bot attacks. \n\nIn the TON sphere, the NFT marketplace – Getgems – will soon implement Soulbound as the NFT standard, according to the GitHub thread. More likely, TON Footsteps' participants will receive them among the first.","id":94,"poster":"./images/posts/94.jpeg"},{"message":"Do you remember about our raffle of two Tegro Dog NFTs going on?\n\nIt ends in 2 days, and you still have enough time to join and win worthy prizes!\n\nTo participate in the giveaway, you only need to be subscribed to The Daily TON and apply through our bot.\n\nOn the 3rd of August, we will announce two random winners!","id":93,"poster":"./images/posts/93.jpeg"},{"message":"Apple is looking for Web3 content directors\n\nApple, an American multinational company, recently opened new vacancies on its official website. Silicon Valley powerhouse is now looking for a creative content director and an art director with a \"demonstrated interest in Web3\".\n\nIt's not the first time the US tech giant sought out cryptospecialists. Last spring, Apple had an open position for a crypto expert for a business development manager with five years of experience in the cryptocurrency industry.\n\nMore and more technology giants worldwide are getting familiar with the crypto industry. We hope the crypto's proliferating will also benefit the TON ecosystem.","id":92,"poster":"./images/posts/92.jpeg"}],"createdImages":[193,192,191,190,189,188,187,184,183,182,180,179,178,177,176,175,174,173,172,171,170,169,168,167,166,165,164,163,162,161,160,159,158,157,156,155,154,153,151,150,149,148,147,146,145,144,143,142,141,140,139,138,137,136,135,134,133,132,131,130,129,128,127,126,125,124,123,122,121,120,119,118,117,116,115,114,113,112,111,110,109,108,107,106,105,104,103,102,101,100,99,98,97,96,95,94,93,92]}